const data = [
    {
        Question: "Վնասվածքային շոկի փուլերն են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "գրգռման և հանդարտման"
    },
    {
        Question: "Եթե առկա է կրծքավանդակի թափանցող վնասվածք և անընդհատ խորացող շնչահեղձություն պետք է ՙ(Ընտրել ճիշտ պատասխանը)",
        Answer: "վերքի վրա դնել պոլիէթիլենային քառակուսի թերթիկ, որի երեք անկյունը ամրացնել մարմնին մեկը թողնել բաց"
    }, {
        Question: "Վնասվածքային շոկի փուլերն են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "գրգռման և հանդարտման"
    },
    {
        Question: "Բաց վնասվածքների խմբին են դասվում (մեկ ճիշտ պատասխան)",
        Answer: "վերքերը"
    },
    {
        Question: "Ի՞նչպես ֆիքսել նախաբազկի կոտրվածքը՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "ֆիքսել մատների ծայրերից մինչև բազկի վերին երրորդը,արմունկը ծալելով ուղիղ անկյան տակ"
    },
    {
        Question: "Առաջին օգնություն հոդախախտի դեպքում (մեկ ճիշտ պատասխան)",
        Answer: "ցավազրկել, անշարժացնել վերջույթը և տեղափոխել առանց ցնցումների"
    },
    {
        Question: "Ողնուղեղի մասնակի վնասման դեպքում առկա են(Ընտրել ճիշտ պատասխանը)",
        Answer: "Վերջույթների շարժումների և զգացողության խանգառումներ"
    },
    {
        Question: "Ոսկրերի մանկական կոտրվածքների ի՞նչ տեսակներ կան (Ընտրել ճիշտ պատասխանը)",
        Answer: "նշված բոլոր տեսակները"
    },
    {
        Question: "Ի՞նչպես անշարժացնել ծայրանդամը բեկակալով, երբ կոտրվել է ազդրոսկրը (Ընտրել ճիշտ պատասխանը)",
        Answer: "բեկակալը դնել ոտքի դրսային մասով այնպես, որ անշարժանան և սրունք-թաթային,և ծնկան,և կոնքազդրային հոդերը"
    },
    {
        Question: "Երկարատև ճնշման համախտանիշի կամ վնասվածքային տոքսիկոզի ախտանշաններն են (մեկ ճիշտ պատասխան)",
        Answer: "ճնշված տեղից ցած մաշկը դառնում է կապտածիրանագույն՝ մանր արյունազեղումներով"
    },
    {
        Question: "Ողնաշարի վնասվածքի կասկածի դեպքում պետք է (Ընտրել ճիշտ պատասխանը)",
        Answer: "Թողնել տեղում՝ բերելով կողքի անվտանգ դիրքի"
    },
    {
        Question: "Որպես կենսաբանական զենքի մանրե կարող են օգտագործվել՝ (Հինգ ճիշտ պատասխան)",
        Answer: "սիբիրախտի հարուցիչը, ժանտախտի հարուցիչը, խոլերաի հարուցիչը, բրուցելոզի հարուցիչը, բծավոր տիֆի հարուցիչը"
    },
    {
        Question: "Ո՞վ է հանդիսանում ՀՀ Քաղպաշտպանության պետ՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "ՀՀ վարչապետը"
    },
    {
        Question: "ՀՀ քաղաքացիները ՔՊ բնագավառում պարտավոր են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "մասնակցել ՔՊ միջոցառումներին"
    },
    {
        Question: "Թվարկել, թե շտապ օգնության ծառայությանը զանգելիս՝103 ինչպիսի տեղեկություններ ենք հաղորդելու (մեկ ճիշտ պատասխան)",
        Answer: "բոլոր նշված տվյալները"
    },
    {
        Question: "Կանխարգելիչ միջոցառումները իրականացվում են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "միչև պատերազմը և ԱԻ-ի առաջանալը"
    },
    {
        Question: "Ի՞նչպես կիրառել Կրամերի բեկակալը բազկոսկրի փակ կոտրվածքի դեպքում (Ընտրել ճիշտ պատասխանը)",
        Answer: "հագուստի վրայից ֆիքսել բոլոր երեք հոդերը՝ ուղիղ անկյան տակ ծալելով արմնկային հոդը"
    },
    {
        Question: "Առաջին օգնությունը օձի կամ կարիճի խայթոցից առաջացած վերքի դեպքում (երկու ճիշտ պատասխան)",
        Answer: "արագորեն ներարկել հակաթույն, դուրս հանել թույնը՝ հատուկ արտածծող սարքով"
    },
    {
        Question: "Գլխի բաց վերքի դեպքում որ վիրակապը պետք է դնել(Ընտրել ճիշտ պատասխանը)",
        Answer: "ստերիլ խոնավ օղակաձև վիրակապ"
    },
    {
        Question: "Տուժածի մոտ առկա են հետևյալ ախտանիշները գլխապտույտ, գլխացավ, սրտխառնոց, հավասարակշռության կորուստ Որ վնասվածքի դեպքում են դիտվում (Ընտրել ճիշտ պատասխանը)",
        Answer: "գլխուղեղի ցնցում"
    },
    {
        Question: "Երկարատև ճնշման համախտանիշի կամ վնասվածքային տոքսիկոզի ախտանշաններն են (մեկ ճիշտ պատասխան)",
        Answer: "ճնշված տեղից ցած մաշկը դառնում է կապտածիրանագույն՝ մանր արյունազեղումներով"
    },
    {
        Question: "Ո՞րոնք են քաղաքացիական պաշտպանության սկզբունքները՝ (3 ճիշտ պատասխան)",
        Answer: "քաղաքացիական տարածքում, ՔՊ իրականացումը՝ տարիքային ըստ ռազմավարական, արտադրական, առանձնահատկությունների, ՔՊ միջոցառումների ղեկավարումը կենտրոնացված կառավարման սկզբունքով"
    },
    {
        Question: "Բնակավայրերում, որտեղ էլեկտրական ազդանշանների ցանց չկա,\Ինչպե՞ս է բնակչությանը ազդարարվում «ՈՒՇԱԴՐՈՒԹՅՈՒՆ ԲՈԼՈՐԻՆ» ազդանշանը։ (Ընտրել ճիշտ պատասխանը)",
        Answer: "նշված բոլոր ուղիները"
    }, {
        Question: "Միջուկային պայթյունից առաջացած ներթափանցող ռադիացիայից կարելի է պաշտպանվել՝ (Հինգ ճիշտ պատասխան)",
        Answer: "հակաճառագայթային թաքստոցներում պատսպարվելով, ՔՊ անհատական պաշտպանական միջոցներով, մեկուսիչ հակագազերով, մետրոպոլիտենի կայարաններում պատսպարվելով, ապաստարաններում պատսպարվելով"
    },
    {
        Question: "ՔՊ բնագավառում,ՀՀ քաղաքացիները իրավունք ունեն՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "ստանալ ճշգրիտ տեղեկատվություն իր պաշտպանվածության աստիճանի մասին"
    },
    {
        Question: "Որտեղ կարելի է պաշտպանվել հարվածող ալիքից՝(Չորս ճիշտ պատասխան)",
        Answer: "հակաճառագայթային թաքստոցում, խրամատներում, խրամուղիներում, շենքի նկուղում և ստորգետնյա կառույցներում"
    },
    {
        Question: "Առաջնահերթ որ օրգան-համակարգի քաղցկեղ կառաջանա ներթափանցող ճառագայթման արդյունքում՝ (Երկու ճիշտ պատասխան)",
        Answer: "արյան քաղցկեղ, վահանաձև գեղձի քաղցկեղ"
    },
    {
        Question: "Ի՞նչ ազդանշան է տրվում բնակավայրերում վտանգի կամ վթարի, աղետի, տարերային\աղետի և այլ արտակարգ իրավիճակների դեպքում։ (Ընտրել ճիշտ պատասխանը)",
        Answer: "ուշադրություն բոլորին"
    },
    {
        Question: "Ո՞րոնք են քաղաքացիական պաշտպանության ուժերը՝ (3 ճիշտ պատասխան)",
        Answer: "քաղաքացիական պաշտպանության զորքերը,փրկարար ուժերը, քաղաքացիական պաշտպանության կազմավորումները"
    },
    {
        Question: "Քիմիական զենքի կիրառման դեպքում, որ միջոցներից կարելի է օգտվել՝ (Երկու ճիշտ պատասխան)",
        Answer: "անհատական դեղարկղիկի միջի համապատասխան միջոցից, անհատական հակաքիմիական ծրարից"
    }, {
        Question: "Նշել վարքագծի կանոնները ռադիոակտիվ վարակված գոտում պաշտպանվելիս՝ (Երեք ճիշտ պատասխան)",
        Answer: "հնարավորինս մեկուսացնել բնակարանը, օգտագործել այնպիսի սննդամթերք, որը միչև վարակված գոտիների առաջանալը, գտնվել է փակ տարածքում, խմել կայուն յոդի 10- 12 կաթիլ լուծված 100մլ ջրի կամ կաթի մեջ"
    },
    {
        Question: "Որոնք են զանգվածային խոցման զենքերը։ (Երեք ճիշտ պատասխան)",
        Answer: "քիմիականը, միջուկայինը, կենսաբանականը"
    },
    {
        Question: "Ի՞նչպես հագցնել վերնահագուստը տուժածին, երբ վնասված է վերին վերջույթը (Ընտրել ճիշտ պատասխանը)",
        Answer: "հագցնել միայն առողջ վերջույթը, իսկ տուժածը չհագցնել"
    },
    {
        Question: "Ողնաշարի վնասվածքի կասկածի դեպքում պետք է առաջինը՝(Ընտրել ճիշտ պատասխանը)",
        Answer: "Ձեռքի տակ եղած միջոցներով անշարժացնել պարանոցը"
    },
    {
        Question: "Տուժածը կորցրել է գիտակցությունը: Բացակայում են սրտի աշխատանքը և շնչառությունը:Նրա մոտ առկա է (Ընտրել ճիշտ պատասխանը)",
        Answer: "կլինիկական մահ"
    },
    {
        Question: "Առաջին օգնություն անդամահատված վերքերի դեպքում (մեկ ճիշտ պատասխան)",
        Answer: "գտնել անդամահատված մարմնամասը և դնել սառույցով լցված պարկի մեջ"
    },
    {
        Question: "Ի՞նչպես անշարժացնել ծայրանդամը բեկակալով, երբ կոտրվել է ազդրոսկրը (Ընտրել ճիշտ պատասխանը)",
        Answer: "բեկակալը դնել ոտքի դրսային մասով այնպես, որ անշարժանան և սրունք-թաթային,և ծնկան,և կոնքազդրային հոդերը"
    }, {
        Question: "Ինչպես անշարժացնել ծայրանդամը բեկակալով, երբ կոտրվել է ազդրոսկրը (մեկ ճիշտ պատասխան)",
        Answer: "բեկակալը դնել ոտքի դրսային մասով այնպես, որ անշարժանան և ոսրունք-թաթային, և ծնկան, և կոնք-ազդրային հոդերը"
    },
    {
        Question: "Առաջին օգնությունը սալջարդի դեպքում (մեկ ճիշտ պատասխան)",
        Answer: "վնասված վերջույթի անշարժացում և սառեցում"
    },
    {
        Question: "Ոսկրերի մանկական կոտրվածքների ինչ տեսակներ կան (Ընտրել ճիշտ պատասխանը)",
        Answer: "նշված բոլոր տեսակները"
    },
    {
        Question: "Գլխի հարվածից հետո տուժածի գիտակցությունը մթագնած է: Ի՞նչ դիրքի պետք է բերել (Ընտրել ճիշտ պատասխանը)",
        Answer: "կողքի անվտանգ դիրքի"
    },
    {
        Question: "Ինչպես կիրառել Կրամերի բեկակալը բազկոսկրի փակ կոտրվածքի դեպքում (մեկ ճիշտ պատասխան)",
        Answer: "հագուստի վրայից ֆիքսել բոլոր երեք հոդերը՝ ուղիղ անկյան տակ ծալելով արմնկային հոդը"
    },
    {
        Question: "Գլխի բաց վերքի դեպքում որ վիրակապը պետք է դնել(Ընտրել ճիշտ պատասխանը)",
        Answer: "ստերիլ խոնավ օղակաձև վիրակապ"
    },
    {
        Question: "Կրծքավանդակի շրջանում ծովի ալիքի հարվածից հետո տուժածի մոտ առկա է արյունախխում, Կրծքավանդակի թեթև ցավ, թուլություն: Առաջացել է՝(Ընտրել ճիշտ պատասխանը)",
        Answer: "Կրծքավանդակի ցնցում"
    },
     {
        Question: "Անօդակյաց վարակների կանխարգելման հիմնական միջոցներն են (մեկ ճիշտ պատասխան)",
        Answer: "բոլոր նշվածների իրականացում"
    },
    {
        Question: "Վնասվածքային շոկի փուլերն են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "գրգռման և հանդարտման"
    },
    {
        Question: "Հակաշոկային միջոցառումներն են՝(Ընտրել 2 ճիշտ պատասխան)",
        Answer: "տուժածին ցավազրկելը, տաքացնելը"
    },
    {
        Question: "Միջուկային պայթյունից առաջացած ներթափանցող ռադիացիայից կարելի է պաշտպանվել (Հինգ ճիշտ պատասխան)",
        Answer: "ապաստարաններում պատսպարվելով, հակաճառագայթային թաքստոցներում պատսպարվելով, գետնանցումներում պատսպարվելով, զրահատեխնիկայում պատսպարվելով, մետրոպոլիտենի կայարաններում պատսպարվելով"
    },
    {
        Question: "ՀՀ քաղաքացիները ՔՊ բնագավառում պարտավոր են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "մասնակցել ՔՊ միջոցառումներին"
    },
    {
        Question: "Ի՞նչ ազդանշան է տրվում բնակավայրերում վտանգի կամ վթարի, աղետի, տարերային\աղետի և այլ արտակարգ իրավիճակների դեպքում: (Ընտրել ճիշտ պատասխանը)",
        Answer: "ուշադրություն բոլորին"
    },
    {
        Question: "Միջուկային պայթյունից առաջացած ներթափանցող ռադիացիան կարող է առաջացնել՝ (Հինգ ճիշտ պատասխան)",
        Answer: "ապաստարաններում պատսպարվելով,հակաճառագայթային թաքստոցներում պատսպարվելով,գետնանցումներում պատսպարվելով,զրահատեխնիկայում պատսպարվելով, մետրոպոլիտենի կայարաններում պատսպարվելով"
    },
     {
        Question: "Միջուկային զեքի խոցող գործոններից են՝ (Հինգ ճիշտ պատասխան)",
        Answer: "հարվածային ալիքը, լուսային ճառագայթը, էլեկտրամագնիսական իմպուլսը, ներթափանցող ռադիացիան, տեղանքի ռադիոակտիվ վարակվածությունը"
    },
    {
        Question: "Նշված վտանգներից, որի պաշտպանությունը չի ապահովում քաղաքացիական պաշտպանությունը: (Ընտրել ճիշտ պատասխանը)",
        Answer: "մասսայական անկարգությունների ժամանակ"
    },
    {
        Question: "Նշել վարքագծի կանոնները ռադիոակտիվ վարակված գոտում պաշտպանվելիս՝ (Երեք ճիշտ պատասխան)",
        Answer: "հնարավորինս մեկուսացնել բնակարանը, օգտագործել այնպիսի սննդամթերք, որը միչև վարակված գոտիների առաջանալը, գտնվել է փակ տարածքում, խմել կայուն յոդի 10-12 կաթիլ լուծված 100մլ ջրի կամ կաթի մեջ"
    },
    {
        Question: "Որոնք են զանգվածային խոցման զենքերը: (Երեք ճիշտ պատասխան)",
        Answer: "քիմիականը, միջուկայինը, կենսաբանականը"
    },
    {
        Question: "Լսելով «Ուշադրություն բոլորին» ազդանշանը՝ անհրաժեշտ է՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "Ընդհատել աշխատանքային գործընթացը, շտապ միացնել ռադիոն կամ հեռուստացույցը, ուշադիր լսել տեղեկատվությունը։"
    },
    {
        Question: "Ո՞րոնք են քաղաքացիական պաշտպանության ուժերը՝ (3 ճիշտ պատասխան)",
        Answer: "քաղաքացիական պաշտպանությանզորքերը, փրկարար ուժերը,քաղաքացիական պաշտպանության կազմավորումները"
    },
    {
        Question: "Ո՞վ է հանդիսանում ՀՀ Քաղպաշտպանության պետ՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "ՀՀ վարչապետը"
    }, {
        Question: "Կանխարգելիչ միջոցառումները իրականացվում են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "միչև պատերազմը և ԱԻ-ի առաջանալը"
    },
    {
        Question: "Կենսաբանական զենքում տեղակայված հարուցիչները կարող են խոցել՝ (Հինգ ճիշտ պատասխան)",
        Answer: "մարդկանց, ընտանի կենդանիներին, վայրի կենդանիներին, թռչուններին, գյուղատնտեսական մշակաբույսերը"
    },
    {
        Question: "ՔՊ հիմնական միջոցառումները իրականացվում են ՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "պատերազմ-ի ժամանակ և նրա սպառնալիքի դեպքում"
    },
    {
        Question: "Ի՞նչ է գտնվում բինարային զենքի մեջ՝ (Մեկ ճիշտ պատասխան)",
        Answer: "առանձին տարողություններում երկու անվնաս գազեր"
    },
    {
        Question: "ՀՀ քաղաքացիները ՔՊ բնագավառում պարտավոր են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "մասնակցել ՔՊ միջոցառումներին"
    },
    {
        Question: "անխարգելիչ միջոցառումները իրականացվում են՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "միչև պատերազմը և ԱԻ-ի առաջանալը"
    },
    {
        Question: "Նշված վտանգներից, որի պաշտպանությունը չի ապահովում քաղաքացիական պաշտպանությունը: (Ընտրել ճիշտ պատասխանը)",
        Answer: "մասսայական անկարգությունների ժամանակ"
    },
     {
        Question: "Միջուկային պայթյունից առաջացած ներթափանցող ռադիացիայից կարելի է պաշտպանվել՝(Հինգ ճիշտ պատասխան)",
        Answer: "ապաստարաններում պատսպարվելով, հակաճառագայթային թաքստոցներում պատսպարվելով, գետնանցումներում պատսպարվելով,զրահատեխնիկայում պատսպարվելով, մետրոպոլիտենի կայարաններում պատսպարվելովAnswer to the first question"
    },
    {
        Question: "«Օդային տագնապ» ազդանշանի դեպքում միացվում են էլեկտրաշչակները և տրվում է՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "տատանվող 3 րոպե տևողությամբ ձայնային ազդանշան"
    },
    {
        Question: "Միջուկային զենքի պայթյունից առաջացած լուսային ճառագայթումը կարող է առաջացնել՝ (Հինգ ճիշտ պատասխան)",
        Answer: "հրդեհներ, այրվածքներ, կուրացումներ, մոխրացում, ծխապատ գոտիներ"
    },
    {
        Question: "Կենսաբանական զենքում գտնվում են՝ (Չորս ճիշտ պատասխան)",
        Answer: "բակտերիաներ, վիրուսներ, բակտերիաների արտադրած թույներ՝ տոքսիններ, սնկեր"
    },
    {
        Question: "ՔՊ հիմնական միջոցառումները իրականացվում են ՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "պատերազմ- ի ժամանակ և նրա սպառնալիքի դեպքում"
    },
    {
        Question: "Լսելով «Ուշադրություն բոլորին» ազդանշանը` անհրաժեշտ է՝ (Ընտրել ճիշտ պատասխանը)",
        Answer: "Ընդհատել աշխատանքային գործընթացը, շտապ միացնել ռադիոն կամ հեռուստացույցը, ուշադիր լսել տեղեկատվությունը։"
    },
    {
        Question: "Ինչ նյութեր են գտնվում միջուկային զենքում՝ (Երկու ճիշտ պատասխան)",
        Answer: "ռադիոակտիվ պլուտոնիում 239, ռադիոակտիվ ուրան 235"
    }, 
    {
        Question: "Ո՞րոնք են քաղաքացիական պաշտպանության ուժերը՝ (3 ճիշտ պատասխան)",
        Answer: "քաղաքացիական պաշտպանության զորքերը, փրկարար ուժերը, քաղաքացիական պաշտպանության կազմավորումները"
    },
    {
        Question: "Ի՞նչպես անշարժացնել ծայրանդամը բեկակալով, երբ կոտրվել է ազդրոսկրը (Ընտրել ճիշտ պատասխանը)",
        Answer: "բեկակալը դնել ոտքի դրսային մասով այնպես, որ անշարժանան և սրունք-թաթային,և ծնկան,և կոնքազդրային հոդերը"
    },
    {
        Question: "Բաց վնասվածքի դեպքում առկա վտանգները (մեկ ճիշտ պատասխան)",
        Answer: "վտանգավոր են բոլոր նշված դեպքերը"
    },
    {
        Question: "Միջուկային զենքի պայթյունից առաջացած հարվածային ալիքը կարող է առաջացնել` (Հինգ ճիշտ պատասխան)",
        Answer: "փլուզումներ, կոտրվածքներ, հոդախախտեր, ցնցումներ, հյուսվածքների սալջարդեր"
    },
    {
        Question: "Ո՞րոնք են քաղաքացիական պաշտպանության սկզբունքները (3 ճիշտ պատասխան)",
        Answer: "քաղաքացիական պաշտպանության իրականացումը ՀՀ ողջ տարածքում, ՔՊ իրականացումը ըստ ռազմավարական, արտադրական, տարիքային առանձնահատկությունների, ՔՊ միջոցառումների ղեկավարումը կենտրոնացված կառավարման սկզբունքով"
    },
    {
        Question: "Ողնաշարի բարդացած վնասվածքի դեպքում տուժածը (Ընտրել ճիշտ պատասխանը)",
        Answer: "Վերջույթները չի կարողանում շարժել"
    },
    {
        Question: "«Օդային տագնապ» ազդանշանը լսելիս, եթե դուք տանը եք, ապա պետք է` (Ընտրել ճիշտ պատասխանը)",
        Answer: "Հագնվեք և հագցրեք ձեր երեխաներին, վերցրեք սնունդ, ջուր, անհատական պաշտպանության միջոցներ, անջատեք գազը, լույսը և ջուրը, զգուշացրեք հարևաններին և ամուր փակեք դուռը, պատուհանները, և հետևել մոտակա պաշտպանիչ կառույց:"
    },
    {
        Question: "Ինչպես անշարժացնել ծայրանդամը բեկակալով, երբ կոտրվել է ազդրոսկրը (մեկ ճիշտ պատասխան)",
        Answer: "բեկակալը դնել ոաքի դրսային մասով այնպես, որ անշարժանան և որունք-թաթային, և՛ ծնկան, և´ կոնք-ազդրային հոդերը"
    },
    {
        Question: "Ի՞նչ ճանապարհով կարող են փոխանցվել հատուկ վտանգավոր, վարակիչ հիվանդությունները: (Երեք ճիշտ պատասխան)",
        Answer: "մարդուց-մարդուն, կենդանուց մարդուն, հոդվածոտանիներից մարդուն"
    }, 
    {
        Question: "Միջուկային զենքի պայթյունից առաջացած լուսային ճառագայթումը կարող է առաջացնել՝ (Հինգ ճիշտ պատասխան)",
        Answer: "հրդեհներ, այրվածքներ, կուրացումներ, մոխրացում, ծխապատ գոտիներ"
    },
    {
        Question: "Ողնաշարի վնասվածքի դեպքում տուժածին պետք է բերել կողքի դիրքի (Ընտրել ճիշտ պատասխանը)",
        Answer: "գլուխն ու մարմինը մեկ առանցքի շուրջ պտտեցնելով"
    },
    {
        Question: "Ձեռքի տակ եղած ինչպիսի իրերով կարելի է ֆիքսել կոտրվածքի շրջանը, եթե չունենք բեկակալներ (մեկ ճիշտ պատասխան)",
        Answer: "շինարարական նեղ տախտակ և նշված բոլոր իրերը"
    },
    {
        Question: "Ոսկրերի մանկական կոտրվածքների ինչ տեսակներ կան (Ընտրել ճիշտ պատասխանը)",
        Answer: "նշված բոլոր տեսակները"
    },
    {
        Question: "Առաջին օգնությունը սալջարդի դեպքում (մեկ ճիշտ պատասխան)",
        Answer: "վնասված վերջույթի անշարժացում և սառեցում"
    },
    {
        Question: "Ինչպես ֆիքսել վերջույթը նախաբազկի ոսկրերի կոտրվածքի դեպքում (մեկ ճիշտ պատասխան)",
        Answer: "ֆիքսել մատների ծայրերից մինչև բազկի վերին երրորդը, արմունկը ծալելով ուղիղ անկյան տակ"
    }
];

const searchInput = document.getElementById('searchInput');
const resultsDiv = document.getElementById('results');

searchInput.addEventListener('input', searchQuestions);

function searchQuestions() {
    const searchText = searchInput.value.toLowerCase();
    const filteredData = data.filter(item => item.Question.toLowerCase().startsWith(searchText));

    displayResults(filteredData);
}

function displayResults(results) {
    resultsDiv.innerHTML = '';



    for (let i = 0; i < results.length; i++) {
        const result = results[i];
        const question = result.Question;
        const answer = result.Answer;

        const questionDiv = document.createElement('div');
        questionDiv.classList.add('result');
        questionDiv.innerHTML = `<strong>${question}</strong><br>${answer}`;

        resultsDiv.appendChild(questionDiv);
    }
    if (results.length === 0) {
        resultsDiv.innerHTML = 'No matching questions found.';
        return;
    }
}
